dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/MotorControl/src/stm32f7xx_svpwm_1shunt.c
  hCCDmaBuffCh2[0] = PWM_PERIOD-HTMIN;
  hCCDmaBuffCh2[1] = PWM_PERIOD-HTMIN;
  hCCDmaBuffCh2[2] = PWM_PERIOD >> 1;
  hCCDmaBuffCh2[3] = PWM_PERIOD >> 1;
  
  hCCDmaBuffCh3[0] = PWM_PERIOD-HTMIN;
  hCCDmaBuffCh3[1] = PWM_PERIOD-HTMIN;
  hCCDmaBuffCh3[2] = PWM_PERIOD >> 1;
  hCCDmaBuffCh3[3] = PWM_PERIOD >> 1;
  
  // After start value of dvDutyValues
  dvDutyValues.hTimePhA = PWM_PERIOD >> 1;
  dvDutyValues.hTimePhB = PWM_PERIOD >> 1;
  dvDutyValues.hTimePhC = PWM_PERIOD >> 1;
  
  // Set the default previous value of Phase A,B,C current
  hCurrAOld=0;
  hCurrBOld=0;
  hCurrCOld=0;
  
  hDeltaA = 0;
  hDeltaB = 0;
  hDeltaC = 0;
  bReadDelta = 0;
  bStatorFluxPosOld = REGULAR;
  bStatorFluxPos = REGULAR;
}

/*******************************************************************************
* Function Name  : SVPWM_1ShuntCalcDutyCycles
* Description    :  Implementation of the single shunt algorithm to setup the 
TIM1 register and DMA buffers values for the next PWM period.
* Input          : Stat_Volt_alfa_beta
* Output         : None
* Return         : None
*******************************************************************************/
void SVPWM_1ShuntCalcDutyCycles (Volt_Components Stat_Volt_Input) //计算占空比值，配置下一次电流采样时的ADC及定时器模式	 FOC 子程序之后调用
{
    s32 wX, wY, wZ, wUAlpha, wUBeta;
    s16 hDeltaDuty[2];
    u16 hDutyV[4]; // the 4th element is the swap tmp
    
/*******************************************************************************
* Function Name  : SVPWM_1ShuntGetDuty
* Description    : Computes the three duty cycle values corresponding to the input value
                        using space vector modulation techinque
* Input          : Stat_Volt_alfa_beta
* Output         : None
* Return         : None
*******************************************************************************/
    //SVPWM_1ShuntGetDuty(Stat_Volt_Input);
    wUAlpha = Stat_Volt_Input.qV_Component1 * T_SQRT3 ;
    wUBeta = -(Stat_Volt_Input.qV_Component2 * T);
  
    wX = wUBeta;
    wY = (wUBeta + wUAlpha)/2;
    wZ = (wUBeta - wUAlpha)/2;
     
    // Sector calculation from wX, wY, wZ
     if (wY<0)
     {
        if (wZ<0)
        {
          bSector = SECTOR_5;
        }
        else // wZ >= 0
          if (wX<=0)
          {
            bSector = SECTOR_4;
          }
          else // wX > 0
          {
            bSector = SECTOR_3;
          }
     }
     else // wY > 0
     {
       if (wZ>=0)
       {
         bSector = SECTOR_2;
       }
       else // wZ < 0
         if (wX<=0)
         {  
           bSector = SECTOR_6;
         }
         else // wX > 0
         {
           bSector = SECTOR_1;
         }
      }
     
     /* Duty cycles computation */
    switch(bSector)
    {  
      case SECTOR_1:
          dvDutyValues.hTimePhA = (T/8) + ((((T + wX) - wZ)/2)/131072);
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhA + wZ/131072;
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhB - wX/131072;
                  break;
      case SECTOR_2:
          dvDutyValues.hTimePhA = (T/8) + ((((T + wY) - wZ)/2)/131072);
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhA + wZ/131072;
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhA - wY/131072;
          break;
      case SECTOR_3:
          dvDutyValues.hTimePhA = (T/8) + ((((T - wX) + wY)/2)/131072);
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhA - wY/131072;
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhC + wX/131072;
          break;
      case SECTOR_4:
          dvDutyValues.hTimePhA = (T/8) + ((((T + wX) - wZ)/2)/131072);
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhA + wZ/131072;
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhB - wX/131072;
          break;  
      case SECTOR_5:
          dvDutyValues.hTimePhA = (T/8) + ((((T + wY) - wZ)/2)/131072);
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhA + wZ/131072;
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhA - wY/131072;
              break;
      case SECTOR_6:
          dvDutyValues.hTimePhA = (T/8) + ((((T - wX) + wY)/2)/131072);
          dvDutyValues.hTimePhC = dvDutyValues.hTimePhA - wY/131072;
          dvDutyValues.hTimePhB = dvDutyValues.hTimePhC + wX/131072;
          break;
      default:
          break;
    }
    
    if (bDistEnab == 1)
    {
      bStatorFluxPosOld = bStatorFluxPos;
    
/*******************************************************************************
* Function Name  : SVPWM_1GetStatorFluxPos
* Description    :  Compute the stator vector position 
                        REGULAR if stator vector lies in regular region
                        BOUNDARY_1 if stator vector lies in boundary region 1 (two small, one big)
                        BOUNDARY_2 if stator vector lies in boundary region 2 (two big, one small)
                        BOUNDARY_3 if stator vector lies in boundary region 3 (three equal)
* Input           : None
* Output         : None
* Return         : None
*******************************************************************************/
      //bStatorFluxPos = SVPWM_1GetStatorFluxPos(); 
      hDutyV[0] = dvDutyValues.hTimePhA;
      hDutyV[1] = dvDutyValues.hTimePhB;
      hDutyV[2] = dvDutyValues.hTimePhC;
      
      // Sort ascendant
      if (hDutyV[0] > hDutyV[1])
      {
        // Swap [0] [1]
        hDutyV[3] = hDutyV[0];
        hDutyV[0] = hDutyV[1];
        hDutyV[1] = hDutyV[3];
      }
      if (hDutyV[0] > hDutyV[2])
      {
        // Swap [0] [2]
        hDutyV[3] = hDutyV[0];
        hDutyV[0] = hDutyV[2];
        hDutyV[2] = hDutyV[3];
      }
      if (hDutyV[1] > hDutyV[2])
      {
        // Swap [1] [2]
        hDutyV[3] = hDutyV[1];
        hDutyV[1] = hDutyV[2];
        hDutyV[2] = hDutyV[3];
      }
      
      // Compute delta duty
      hDeltaDuty[0] = (s16)(hDutyV[1]) - (s16)(hDutyV[0]);
      hDeltaDuty[1] = (s16)(hDutyV[2]) - (s16)(hDutyV[1]);
      
      // Check region
      if ((hDeltaDuty[1]>TMIN) && (hDeltaDuty[0]<=TMIN))
        bStatorFluxPos = BOUNDARY_2;
      else if ((hDeltaDuty[1]<=TMIN) && (hDeltaDuty[0]>TMIN))
        bStatorFluxPos = BOUNDARY_1;
      else if ((hDeltaDuty[1]>TMIN) && (hDeltaDuty[0]>TMIN))
        bStatorFluxPos = REGULAR;    
      else
        bStatorFluxPos = BOUNDARY_3;
    
