dongdong-2009/project_zynq7000/rt-thread/bsp/stm32f7-disco/MotorControl/src/stm32f7xx_svpwm_1shunt.c
      if (dvDutyValues.hTimePhB < DMABURSTMIN_B)
        dvDutyValues.hTimePhB = DMABURSTMIN_B;
    }
    break;
  case INVERT_C: 
    if (hCCRBuff[2] <= DMABURSTMIN_C)
    {
      // Reset the status
      TIM1->CCMR2 = TIM1->CCMR2 & 0xFF8F; // Switch to Frozen Ch3
      TIM1->CCMR2 = TIM1->CCMR2 | 0x0040; // Force Low Ch3
      TIM1->CCMR2 = TIM1->CCMR2 & 0xFF8F; // Switch to Frozen Ch3
      TIM1->CCMR2 = TIM1->CCMR2 | 0x0030; // Switch to Toggle Ch3
      
      //TIM1_DMACmd(TIM1_DMA_CC3, ENABLE); 
      TIM1->DIER |= TIM_DMA_CC3;
      DMA1_Channel6->CCR &= CCR_ENABLE_Reset;
      DMA1_Channel6->CNDTR = 4;
      DMA1_Channel6->CCR |= CCR_ENABLE_Set;

      TIM_GenerateEvent(TIM1, TIM_EventSource_CC3);
      
      if (dvDutyValues.hTimePhC < DMABURSTMIN_C)
        dvDutyValues.hTimePhC = DMABURSTMIN_C;
    }
    break;
  }

  // Update remaining DMA buffer
  hCCDmaBuffCh4[0] = dvDutyValues.hTimeSmp2; // Second point 
  hCCDmaBuffCh4[1] = dvDutyValues.hTimeSmp2;
  hCCDmaBuffCh4[2] = dvDutyValues.hTimeSmp1; // First point
  hCCDmaBuffCh4[3] = dvDutyValues.hTimeSmp1;
  
  hCCDmaBuffCh1[2] = dvDutyValues.hTimePhA;
  hCCDmaBuffCh1[3] = dvDutyValues.hTimePhA;
  
  hCCDmaBuffCh2[2] = dvDutyValues.hTimePhB;
  hCCDmaBuffCh2[3] = dvDutyValues.hTimePhB;
  
  hCCDmaBuffCh3[2] = dvDutyValues.hTimePhC;
  hCCDmaBuffCh3[3] = dvDutyValues.hTimePhC;
  
  bInverted_pwm = bInverted_pwm_new;
  
  /* ADC1 Injected conversions trigger is TIM1 TRGO */ 
  ADC_ExternalTrigInjectedConvConfig(ADC1, ADC_ExternalTrigInjecConv_T1_CC4); 
  
  // Enabling the Injectec conversion for ADC1
  ADC_ExternalTrigInjectedConvCmd(ADC1,ENABLE);
}


#endif
#endif
/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/  
